src/cf/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносамУНФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыСФондамиПоСтраховымВзносамУНФ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Comment>Это может быть как головная организация, так и обособленное подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбязательногоСтрахованияСотрудников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбязательногоСтрахованияСотрудниковУНФ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоСтраховыеВзносы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭтоРасчетыПоНачислениюУплатеВзносовВФСС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/cf/AccumulationRegisters/РасчетыСФондамиПоСтраховымВзносамУНФ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Процедура создает пустую временную таблицу изменения движений.
//
Процедура СоздатьПустуюВременнуюТаблицуИзменение(ДополнительныеСвойства) Экспорт
	
	Если НЕ ДополнительныеСвойства.Свойство("ДляПроведения")
	 ИЛИ НЕ ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда	
		Возврат;		
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 0
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.НомерСтроки КАК НомерСтроки,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.ВидДвижения КАК ВидДвижения,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Организация КАК Организация,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.ВидОбязательногоСтрахованияСотрудников КАК ВидОбязательногоСтрахованияСотрудников,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Сотрудник КАК Сотрудник,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.ЭтоСтраховыеВзносы КАК ЭтоСтраховыеВзносы,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.ЭтоРасчетыПоНачислениюУплатеВзносовВФСС КАК ЭтоРасчетыПоНачислениюУплатеВзносовВФСС,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма КАК СуммаПередЗаписью,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма КАК СуммаИзменение,
	|	РасчетыСФондамиПоСтраховымВзносамУНФ.Сумма КАК СуммаПриЗаписи
	|ПОМЕСТИТЬ ДвиженияРасчетыСФондамиПоСтраховымВзносамИзменение
	|ИЗ
	|	РегистрНакопления.РасчетыСФондамиПоСтраховымВзносамУНФ КАК РасчетыСФондамиПоСтраховымВзносамУНФ");
	
	Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
	СтруктураВременныеТаблицы.Вставить("ДвиженияРасчетыСФондамиПоСтраховымВзносамИзменение", Ложь);
	
КонецПроцедуры

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли
